niexuzhong/mm32gnuarm/include/MM32F003_q.h
#define  ADCFG_SAMCTL                         ((uint32_t)0x00003C00)               /*!<ADC sample time select*/

#define  ADCFG_SAMCTL_0                       ((uint32_t)0x00000400)
#define  ADCFG_SAMCTL_1                       ((uint32_t)0x00000800)
#define  ADCFG_SAMCTL_2                       ((uint32_t)0x00001000)
#define  ADCFG_SAMCTL_3                       ((uint32_t)0x00002000)
#define  ADCFG_SAMCTL_OFFSET                  10
#define  ADCFG_SAMCTL_1_5                     ((uint32_t)0x0<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 1.5t*/
#define  ADCFG_SAMCTL_7_5                     ((uint32_t)0x1<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 7.5t*/
#define  ADCFG_SAMCTL_13_5                    ((uint32_t)0x2<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 13.5t*/
#define  ADCFG_SAMCTL_28_5                    ((uint32_t)0x3<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 28.5t*/
#define  ADCFG_SAMCTL_41_5                    ((uint32_t)0x4<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 41.5t*/
#define  ADCFG_SAMCTL_55_5                    ((uint32_t)0x5<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 55.5t*/
#define  ADCFG_SAMCTL_71_5                    ((uint32_t)0x6<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 71.5t*/
#define  ADCFG_SAMCTL_239_5                   ((uint32_t)0x7<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 239.5t*/
#define  ADCFG_SAMCTL_2_5                     ((uint32_t)0x8<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 2.5t*/
#define  ADCFG_SAMCTL_3_5                     ((uint32_t)0x9<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 3.5t*/
#define  ADCFG_SAMCTL_4_5                     ((uint32_t)0xA<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 4.5t*/
#define  ADCFG_SAMCTL_5_5                     ((uint32_t)0xB<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 5.5t*/
#define  ADCFG_SAMCTL_6_5                     ((uint32_t)0xC<<ADCFG_SAMCTL_OFFSET) /*!<ADC sample time select 6.5t*/

/********************  Bit definition for ADCR register  ********************/
#define  ADCR_ADIE                            ((uint32_t)0x00000001)               /*!<ADC interrupt enable */
#define  ADCR_ADWIE                           ((uint32_t)0x00000002)               /*!<ADC window compare interrupt enable */
#define  ADCR_TRGEN                           ((uint32_t)0x00000004)               /*!<extranal trigger single start AD convert */
#define  ADCR_DMAEN                           ((uint32_t)0x00000008)               /*!<ADC DMA enable */

#define  ADCR_TRGSEL                          ((uint32_t)0x00060070)               /*!<TRGSEL[6:4][18:17] ADC external trigger source select */
#define  ADCR_TRGSEL_0                        ((uint32_t)0x00000010)               /*!<Bit 0 */
#define  ADCR_TRGSEL_1                        ((uint32_t)0x00000020)               /*!<Bit 1 */
#define  ADCR_TRGSEL_2                        ((uint32_t)0x00000040)               /*!<Bit 2 */
#define  ADCR_TRGSEL_3                        ((uint32_t)0x00020000)               /*!<Bit 3 */
#define  ADCR_TRGSEL_4                        ((uint32_t)0x00040000)               /*!<Bit 4 */

#define  ADCR_TRGSEL_TIM1_CC1                 ((uint32_t)0x00000000)               /*!<TIM1_CC1 as trig source*/
#define  ADCR_TRGSEL_TIM1_CC2                 ((uint32_t)0x00000010)               /*!<TIM1_CC2 as trig source*/
#define  ADCR_TRGSEL_TIM1_CC3                 ((uint32_t)0x00000020)               /*!<TIM1_CC3 as trig source*/
#define  ADCR_TRGSEL_TIM2_CC2                 ((uint32_t)0x00000030)               /*!<TIM2_CC2 as trig source*/
#define  ADCR_TRGSEL_TIM3_TRGO                ((uint32_t)0x00000040)               /*!<TIM3_TRGO as trig source*/
#define  ADCR_TRGSEL_TIM1_CC1_CC5             ((uint32_t)0x00000050)               /*!<TIM1_CC1 and CC5 as trig source*/
#define  ADCR_TRGSEL_TIM3_CC1                 ((uint32_t)0x00000060)               /*!<TIM3_CC1 as trig source*/
#define  ADCR_TRGSEL_EXTI_11                  ((uint32_t)0x00000070)               /*!<EXTI_11 as trig source*/

#define  ADCR_ADST                            ((uint32_t)0x00000100)               /*!<ADC start convert data */   

#define  ADCR_ADMD                            ((uint32_t)0x00000600)               /*!<ADC convert mode */
#define  ADCR_ADMD_0                          ((uint32_t)0x00000200)               /*!<Bit 0 */
#define  ADCR_ADMD_1                          ((uint32_t)0x00000400)               /*!<Bit 1 */

#define  ADCR_ADMD_SINGLE                     ((uint32_t)0x00000000)               /*!<ADC single convert mode */  
#define  ADCR_ADMD_PERIOD                     ((uint32_t)0x00000200)               /*!<ADC single period convert mode */ 
#define  ADCR_ADMD_CONTINUE                   ((uint32_t)0x00000400)               /*!<ADC continue scan convert mode */ 

#define  ADCR_ALIGN                           ((uint32_t)0x00000800)               /*!<ADC data alignment */
#define  ADCR_ALIGN_LEFT                      ((uint32_t)0x00000800)               /*!<ADC data left align */ 
#define  ADCR_ALIGN_RIGHT                     ((uint32_t)0x00000000)               /*!<ADC data right align */ 

#define  ADCR_CMPCH                           ((uint32_t)0x0000F000)               /*!<CMPCH[15:12] ADC window compare channel0 convert data */  
#define  ADCR_CMPCH_0                         ((uint32_t)0x00001000)               /*!<Bit 0 */  
#define  ADCR_CMPCH_1                         ((uint32_t)0x00002000)               /*!<Bit 1 */  
#define  ADCR_CMPCH_2                         ((uint32_t)0x00004000)               /*!<Bit 2 */  
#define  ADCR_CMPCH_3                         ((uint32_t)0x00008000)               /*!<Bit 3 */ 

#define  ADCR_SCANDIR                         ((uint32_t)0x00010000)               /*!<ADC scan direction */ 

#define  ADCR_TRGSHIFT                        ((uint32_t)0x00380000)               /*!<External trigger shift sample */
#define  ADCR_TRGSHIFT_0                      ((uint32_t)0x00000000)               /*!<No shift */
#define  ADCR_TRGSHIFT_4                      ((uint32_t)0x00080000)               /*!<Shift 4 period */
#define  ADCR_TRGSHIFT_16                     ((uint32_t)0x00100000)               /*!<Shift 16 period */
#define  ADCR_TRGSHIFT_32                     ((uint32_t)0x00180000)               /*!<Shift 32 period */
#define  ADCR_TRGSHIFT_64                     ((uint32_t)0x00200000)               /*!<Shift 64 period */
#define  ADCR_TRGSHIFT_128                    ((uint32_t)0x00280000)               /*!<Shift 128 period */
#define  ADCR_TRGSHIFT_256                    ((uint32_t)0x00300000)               /*!<Shift 256 period */
#define  ADCR_TRGSHIFT_512                    ((uint32_t)0x00380000)               /*!<Shift 512 period */ 
/********************  Bit definition for ADCHS register  ********************/
#define ADCHS_CHEN ((uint32_t)0x0000DFFF)   /*!<ADC channel select */

#define  ADCHS_CHEN0                          ((uint32_t)0x00000001)              /*!<ADC channel0 enable */    
#define  ADCHS_CHEN1                          ((uint32_t)0x00000002)              /*!<ADC channel1 enable */   
#define  ADCHS_CHEN2                          ((uint32_t)0x00000004)              /*!<ADC channel2 enable */   
#define  ADCHS_CHEN3                          ((uint32_t)0x00000008)              /*!<ADC channel3 enable */   
#define  ADCHS_CHEN4                          ((uint32_t)0x00000010)              /*!<ADC channel4 enable */   
#define  ADCHS_CHEN5                          ((uint32_t)0x00000020)              /*!<ADC channel5 enable */   
#define  ADCHS_CHEN6                          ((uint32_t)0x00000040)              /*!<ADC channel6 enable */   
#define  ADCHS_CHEN7                          ((uint32_t)0x00000080)              /*!<ADC channel7 enable */
#define  ADCHS_CHEN8                          ((uint32_t)0x00000100)              /*!<ADC channel8 enable */
#define  ADCHS_CHEN9                          ((uint32_t)0x00000200)              /*!<ADC channel9 enable */
#define  ADCHS_CHEN10                         ((uint32_t)0x00000400)              /*!<ADC channel10 enable */
#define  ADCHS_CHEN11                         ((uint32_t)0x00000800)              /*!<ADC channel11 enable */   
#define  ADCHS_CHEN12                         ((uint32_t)0x00001000)              /*!<ADC channel12 enable */   
#define  ADCHS_CHENTS                         ((uint32_t)0x00004000)              /*!<Temperature Sensor enable */   
#define  ADCHS_CHENVS                         ((uint32_t)0x00008000)              /*!<Voltage Sensor enable */   

/********************  Bit definition for ADCMPR register  ********************/                       
#define  ADCMPR_CMPLDATA                      ((uint32_t)0x00000FFF)              /*!<ADC 12bit window compare DOWN LEVEL DATA*/     
#define  ADCMPR_CMPHDATA                      ((uint32_t)0x0FFF0000)              /*!<ADC 12bit window compare UP LEVEL DATA*/                                              

/********************  Bit definition for ADSTA register  ********************/                          
#define  ADSTA_ADIF                           ((uint32_t)0x00000001)               /*!<ADC convert complete flag*/                     
#define  ADSTA_ADWIF                          ((uint32_t)0x00000002)               /*!<ADC compare flag*/                     
#define  ADSTA_BUSY                           ((uint32_t)0x00000004)               /*!<ADC busy flag*/                     
#define  ADSTA_CHANNEL                        ((uint32_t)0x000000F0)               /*!<CHANNEL[7:4] ADC current channel*/                     
#define  ADSTA_CHANNEL_0                      ((uint32_t)0x00000010)               /*!<Bit 0 */
#define  ADSTA_CHANNEL_1                      ((uint32_t)0x00000020)               /*!<Bit 1*/
#define  ADSTA_CHANNEL_2                      ((uint32_t)0x00000040)               /*!<Bit 2*/
#define  ADSTA_CHANNEL_3                      ((uint32_t)0x00000080)               /*!<Bit 3*/
#define ADSTA_CHANNEL_CH0                     ((uint32_t)0x00000000)               /*!<Channel 0 */
#define ADSTA_CHANNEL_CH1                     ((uint32_t)0x00000010)               /*!<Channel 1*/
#define ADSTA_CHANNEL_CH2                     ((uint32_t)0x00000020)               /*!<Channel 2*/
#define ADSTA_CHANNEL_CH3                     ((uint32_t)0x00000030)               /*!<Channel 3*/
#define ADSTA_CHANNEL_CH4                     ((uint32_t)0x00000040)               /*!<Channel 4 */
#define ADSTA_CHANNEL_CH5                     ((uint32_t)0x00000050)               /*!<Channel 5*/
#define ADSTA_CHANNEL_CH6                     ((uint32_t)0x00000060)               /*!<Channel 6*/
#define ADSTA_CHANNEL_CH7                     ((uint32_t)0x00000070)               /*!<Channel 7*/
#define ADSTA_CHANNEL_CH8                     ((uint32_t)0x00000080)               /*!<Channel 8 */
#define ADSTA_CHANNEL_CH9                     ((uint32_t)0x00000090)               /*!<Channel 9*/
#define ADSTA_CHANNEL_CH10                    ((uint32_t)0x000000A0)               /*!<Channel 10*/
#define ADSTA_CHANNEL_CH11                    ((uint32_t)0x000000B0)               /*!<Channel 11*/
#define ADSTA_CHANNEL_CH12                    ((uint32_t)0x000000C0)               /*!<Channel 12*/
#define ADSTA_CHANNEL_CH13                    ((uint32_t)0x000000D0)               /*!<Channel 13*/
#define ADSTA_CHANNEL_CH14                    ((uint32_t)0x000000E0)               /*!<Channel 14*/
#define ADSTA_CHANNEL_CH15                    ((uint32_t)0x000000F0)               /*!<Channel 15*/
                                              
#define  ADSTA_VALID                          ((uint32_t)0x000FFF00)               /*!<VALID[19:8] ADC channel0 valid flag*/
#define  ADSTA_VALID_0                        ((uint32_t)0x00000100)               /*!<Bit 0*/
#define  ADSTA_VALID_1                        ((uint32_t)0x00000200)               /*!<Bit 1*/
#define  ADSTA_VALID_2                        ((uint32_t)0x00000400)               /*!<Bit 2*/
#define  ADSTA_VALID_3                        ((uint32_t)0x00000800)               /*!<Bit 3*/
#define  ADSTA_VALID_4                        ((uint32_t)0x00001000)               /*!<Bit 4*/
#define  ADSTA_VALID_5                        ((uint32_t)0x00002000)               /*!<Bit 5*/
#define  ADSTA_VALID_6                        ((uint32_t)0x00004000)               /*!<Bit 6*/
#define  ADSTA_VALID_7                        ((uint32_t)0x00008000)               /*!<Bit 7*/
#define  ADSTA_VALID_8                        ((uint32_t)0x00010000)               /*!<Bit 8*/
#define  ADSTA_VALID_9                        ((uint32_t)0x00020000)               /*!<Bit 9*/
#define  ADSTA_VALID_10                       ((uint32_t)0x00040000)               /*!<Bit 10*/
#define  ADSTA_VALID_11                       ((uint32_t)0x00080000)               /*!<Bit 11*/

#define  ADSTA_OVERRUN                        ((uint32_t)0xFFF00000)               /*!<OVERRUN[31:20] ADC channel0 data covered flag*/
#define  ADSTA_OVERRUN_0                      ((uint32_t)0x00100000)               /*!<Bit 0*/
#define  ADSTA_OVERRUN_1                      ((uint32_t)0x00200000)               /*!<Bit 1*/
#define  ADSTA_OVERRUN_2                      ((uint32_t)0x00400000)               /*!<Bit 2*/
#define  ADSTA_OVERRUN_3                      ((uint32_t)0x00800000)               /*!<Bit 3*/
#define  ADSTA_OVERRUN_4                      ((uint32_t)0x01000000)               /*!<Bit 4*/
#define  ADSTA_OVERRUN_5                      ((uint32_t)0x02000000)               /*!<Bit 5*/
#define  ADSTA_OVERRUN_6                      ((uint32_t)0x04000000)               /*!<Bit 6*/
#define  ADSTA_OVERRUN_7                      ((uint32_t)0x08000000)               /*!<Bit 7*/
#define  ADSTA_OVERRUN_8                      ((uint32_t)0x10000000)               /*!<Bit 8*/  
#define  ADSTA_OVERRUN_9                      ((uint32_t)0x20000000)               /*!<Bit 9*/  
#define  ADSTA_OVERRUN_10                     ((uint32_t)0x40000000)               /*!<Bit 10*/  
#define  ADSTA_OVERRUN_11                     ((uint32_t)0x80000000)               /*!<Bit 11*/  

/********************  Bit definition for ADDR0~ADDR15 register  ********************/
#define  ADDR_DATA                            ((uint32_t)0x00000FFF)               /*!<ADC channel convert data */
#define  ADDR_OVERRUN                         ((uint32_t)0x00100000)               /*!<ADC data covered flag */
#define  ADDR_VALID                           ((uint32_t)0x00200000)               /*!<ADC data valid flag*/

/********************  Bit definition for ADSTA_EXT register  ********************/
#define  ADSTA_EXT_VALID                      ((uint32_t)0x0000000F)               /*!<Valid flag */

