niexuzhong/mm32gnuarm/include/MM32F003_q.h
/*----------------------------------------------------------------------------*/

/******************  Bit definition for FLASH_RDP register  *******************/
#define  FLASH_RDP_RDP                       ((uint32_t)0x000000FF)        /*!<Read protection option byte */
#define  FLASH_RDP_nRDP                      ((uint32_t)0x0000FF00)        /*!<Read protection complemented option byte */

/******************  Bit definition for FLASH_USER register  ******************/
#define  FLASH_USER_USER                     ((uint32_t)0x00FF0000)        /*!<User option byte */
#define  FLASH_USER_nUSER                    ((uint32_t)0xFF000000)        /*!<User complemented option byte */

/******************  Bit definition for FLASH_Data0 register  *****************/
#define  FLASH_Data0_Data0                   ((uint32_t)0x000000FF)        /*!<User data storage option byte */
#define  FLASH_Data0_nData0                  ((uint32_t)0x0000FF00)        /*!<User data storage complemented option byte */

/******************  Bit definition for FLASH_Data1 register  *****************/
#define  FLASH_Data1_Data1                   ((uint32_t)0x00FF0000)        /*!<User data storage option byte */
#define  FLASH_Data1_nData1                  ((uint32_t)0xFF000000)        /*!<User data storage complemented option byte */

/******************  Bit definition for FLASH_WRP0 register  ******************/
#define  FLASH_WRP0_WRP0                     ((uint32_t)0x000000FF)        /*!<Flash memory write protection option bytes */
#define  FLASH_WRP0_nWRP0                    ((uint32_t)0x0000FF00)        /*!<Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRP1 register  ******************/
#define  FLASH_WRP1_WRP1                     ((uint32_t)0x00FF0000)        /*!<Flash memory write protection option bytes */
#define  FLASH_WRP1_nWRP1                    ((uint32_t)0xFF000000)        /*!<Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRP2 register  ******************/
#define  FLASH_WRP2_WRP2                     ((uint32_t)0x000000FF)        /*!<Flash memory write protection option bytes */
#define  FLASH_WRP2_nWRP2                    ((uint32_t)0x0000FF00)        /*!<Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRP3 register  ******************/
#define  FLASH_WRP3_WRP3                     ((uint32_t)0x00FF0000)        /*!<Flash memory write protection option bytes */
#define  FLASH_WRP3_nWRP3                    ((uint32_t)0xFF000000)        /*!<Flash memory write protection complemented option bytes */



/**
* @}
*/

/**
* @}
*/ 

#ifdef USE_STDPERIPH_DRIVER
#include "HAL_conf.h"
#endif

/** @addtogroup Exported_macro
* @{
*/

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~CLEARMASK)) | (SETMASK)))



/* Exported macro ------------------------------------------------------------*/
#ifdef  USE_FULL_ASSERT

/**
* @brief  The assert_param macro is used for function's parameters check.
* @param expr: If expr is false, it calls assert_failed function
*   which reports the name of the source file and the source
*   line number of the call that failed. 
*   If expr is true, it returns no value.
* @retval : None
*/
#define assert_param(expr) ((expr) ? (void)0 : assert_failed((uint8_t *)__FILE__, __LINE__))
/* Exported functions ------------------------------------------------------- */
void assert_failed(uint8_t* file, uint32_t line);
#else
#define assert_param(expr) ((void)0)
#endif /* USE_FULL_ASSERT */


/**
* @}
*/

#endif  

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/
//redefine

#define DMA_Channel1_IRQn         DMA1_Channel1_IRQn
#define DMA_Channel2_3_IRQn       DMA1_Channel2_3_IRQn
#define DMA_Channel4_5_IRQn       DMA1_Channel4_5_IRQn

#define ADC_IRQn    ADC_COMP_IRQn
#define I2C_IRQn    I2C1_IRQn
#define SPI_IRQn    SPI2_IRQn
#define UART_IRQn   UART2_IRQn

#define ADC_BASE              ADC1_BASE
#define I2C_BASE              I2C1_BASE
#define SPI_BASE              SPI2_BASE
#define UART_BASE             UART2_BASE


#define DMA_BASE               DMA1_BASE


#define DMA_Channel1_BASE      DMA1_Channel1_BASE
#define DMA_Channel2_BASE      DMA1_Channel2_BASE
#define DMA_Channel3_BASE      DMA1_Channel3_BASE
#define DMA_Channel4_BASE      DMA1_Channel4_BASE
#define DMA_Channel5_BASE      DMA1_Channel5_BASE


#define DMA_Channel1       DMA1_Channel1 
#define DMA_Channel2       DMA1_Channel2 
#define DMA_Channel3       DMA1_Channel3 
#define DMA_Channel4       DMA1_Channel4 
#define DMA_Channel5       DMA1_Channel5



#define ADC                 ((ADC_TypeDef *)ADC1_BASE)
#define DMA                 ((DMA_TypeDef *)DMA1_BASE)
#define UART                ((UART_TypeDef *)UART2_BASE)
#define I2C                 ((I2C_TypeDef *)I2C1_BASE)
#define SPI                 ((SPI_TypeDef *)SPI2_BASE)

#define RCC_APB2RSTR_ADCRST                 RCC_APB2RSTR_ADC1RST
#define RCC_APB1RSTR_SPIRST                 RCC_APB1RSTR_SPI2RST          /*!< SPI reset */
#define RCC_APB1RSTR_UARTRST                RCC_APB1RSTR_UART2RST         /*!< UART 2 reset */
#define RCC_APB1RSTR_I2CRST                 RCC_APB1RSTR_I2C1RST

#define RCC_AHBENR_DMAEN                    RCC_AHBENR_DMA1EN
#define RCC_AHBENR_FCEN                     RCC_AHBENR_FLITFEN
#define RCC_APB2ENR_ADCEN                   RCC_APB2ENR_ADC1EN            /*!< ADC interface clock enable */

#define RCC_APB2RSTR_TIM14EN                RCC_APB2ENR_TIM14EN
#define RCC_APB2RSTR_TIM16EN                RCC_APB2ENR_TIM16EN           /*!< TIM16 Timer clock enable */
#define RCC_APB2RSTR_TIM17EN                RCC_APB2ENR_TIM17EN           /*!< TIM17 Timer clock enable */
#define RCC_APB2RSTR_DBGMCUEN               RCC_APB2ENR_DBGMCUEN          /*!< Debug MCU clock enable */

#define RCC_APB1ENR_SPIEN                   RCC_APB1ENR_SPI2EN            /*!< SPI clock enable */
#define RCC_APB1ENR_UARTEN                  RCC_APB1ENR_UART2EN           /*!< UART 2 clock enable */
#define RCC_APB1ENR_I2CEN                   RCC_APB1ENR_I2C1EN


/*-------------------------(C) COPYRIGHT 2018 MindMotion ----------------------*/
